// GPSFixExport.h: interface for the CGPSFixExport class.
//
//////////////////////////////////////////////////////////////////////

#if !defined(AFX_GPSFIXEXPORT_H__EC03423E_DF7C_4316_BEFB_6519B4620F76__INCLUDED_)
#define AFX_GPSFIXEXPORT_H__EC03423E_DF7C_4316_BEFB_6519B4620F76__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

/****************************************************************************
* 功能：初始化纠偏Dll调用环境
* 输入参数：无
* 输出参数：无
* 返回值：无
******************************************************************************/
AFX_EXT_API void GPS_FIX_DLL_INIT();

/****************************************************************************
* 功能：反初始化纠偏Dll调用环境
* 输入参数：无
* 输出参数：无
* 返回值：无
******************************************************************************/
AFX_EXT_API void GPS_FIX_DLL_UNINIT();

/****************************************************************************
* 功能：对中国大陆地区的经纬度数据进行纠偏,国外数据原样返回
* 输入参数：lat 纬度, lng 经度
* 输出参数：lat 纠偏后纬度, lng 纠偏后经度
* 返回值：无
******************************************************************************/
AFX_EXT_API void GPS_FIX_DLL_FIX_LAT_LNG(DOUBLE *lat, DOUBLE *lng);

/****************************************************************************
* 功能：将地图上获取的偏移的GPS坐标转化为真实GPS坐标，
*只对中国范围内的数据进行处理,其它数据不处理原样返回
* 输入参数：lat 偏移的纬度, lng 偏移的经度
* 输出参数：lat 真实纬度, lng 真实经度
* 返回值：无
******************************************************************************/
AFX_EXT_API void GPS_FIX_DLL_REVERSE_FIX_LAT_LNG(DOUBLE *lat, DOUBLE *lng);

#endif // !defined(AFX_GPSFIXEXPORT_H__EC03423E_DF7C_4316_BEFB_6519B4620F76__INCLUDED_)
